# LIGHT:
#
# 1. Напишите функцию (F): на вход список имен и целое число N; на выходе список длины N случайных имен из первого списка (могут повторяться, можно взять значения: количество имен 20, N = 100, рекомендуется использовать функцию random);

import random

name = ('маша','паша','женя','леша','кирилл','вика','марина','дима','сергей','антон','борис','саша','вика','олег','даша','наташа','вова','аркадий','святослав')
def name_list(name, 100)
    return random(name)
print(name_list(name))

# 2. Напишите функцию вывода самого частого имени из списка на выходе функции F;
#
# 3. Напишите функцию вывода самой редкой буквы, с которого начинаются имена в списке на выходе функции F.
#
# PRO:
#
# LIGHT +
#
# 4.  В файле с логами найти дату самого позднего лога (по метке времени): https://drive.google.com/open?id=1pKGu-u2Vvtx4xK8i2ZhOzE5rBXyO4qd8